tese530_p03_3175/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default         none;

    div(phi1,U.gi)      Gauss limitedLinearV 1;
    div(phi1,Y1i_h)   Gauss limitedLinear 1;
    div(phi1,K)      Gauss limitedLinear 1;
    div(phid,p1)     Gauss limitedLinear 1;
    div(phi1,epsilon) Gauss limitedLinear 1;
    div(phi1,k) Gauss limitedLinear 1;
    div(((rho1*nuEff.gi)*dev2(T(grad(U.gi))))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear orthogonal;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         orthogonal;
}



// ************************************************************************* //
