tese530_p03_3175/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "rho1.*"
    {
        solver          diagonal;
    }
    
    "rho2.*"
    {
        solver          diagonal;
    }

    p
    {
        solver           PCG;
        preconditioner   DIC;
        tolerance        1e-6;
        relTol           0.1;
    }

    pFinal
    {
        $p;
        tolerance        1e-6;
        relTol           0.0;
    }

    "(U.*|h.*|k|epsilon)"
    {
        solver          PBiCGStab;
        preconditioner  diagonal;
        tolerance       1e-6;
        relTol          0;
    }

    "(U.*|h.*|k|epsilon)Final"
    {
        $U;
        relTol          0;
    }

    TcFinal
    {
        //solver          PBiCGStab;
        //preconditioner  diagonal;
        //tolerance       1e-6;
        //relTol          0;
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-06;
        relTol          0;
    }

    T.gsFinal
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-06;
        relTol          0;
    }
    
    
    Y1i
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-12;
        relTol          0;
        minIter         1;
        residualAlpha   1e-8;
    }

    Y2i
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-12;
        relTol          0;
        minIter         1;
        residualAlpha   1e-8;
    }   
   
}

PIMPLE
{
    momentumPredictor no;
    nOuterCorrectors  1;
    nCorrectors     2;
    nNonOrthogonalCorrectors 0;
}


// ************************************************************************* //
