tese530_p03_3175/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

application=`getApplication`

# create mesh
runApplication blockMesh

runApplication  $application

(cd validation && ./Allrun $*)

#------------------------------------------------------------------------------
